<<<<<<< HEAD
# Чтобы ввел
=======

temp = input("Введите температуру (например, 40C или 100F): ")  # Вводим строку
#temp - название переменной, в которую будет сохранён ввод пользователя.
#= - оператор присвРаивания //для присвоения значения, которое находится справа, переменной слева. Тут присваиваем результат функции input() переменной temp.
#input(...) - запрашивает у пользователя ввод данных с клавиатуры. 



# Удалить пробелы в начале и конце строки
temp = temp.strip()  # тут метод строк 

#temp.strip() - удаляет лишние пробелы в начале и конце строки, если они есть
#temp = - мы снова присваиваем результат (строку без пробелов) обратно переменной temp


# Проверка, заканчивается ли строка на 'C' или 'F'
if temp[-1] == 'C':  # Проверка последнего символа
#if - условный оператор. Ппроверяет, выполняется ли условие. Если да, то выполняется код под ним.
#temp[-1] - способ получить последний символ строки temp. !! "-1" означает, что мы берём последний символ.
#== 'C' - мы сравниваем последний символ с буквой 'C'. Если они равны, то условие выполняется.



    # Получаем числовую часть температурык
    celsius = float(temp[:-1])  # Преобразуем строку в число
#float(...) - преобразует строку в число с плавающей запятой (например, 40.0).
#temp[:-1] -  берём всю строку temp, кроме последнего символа (ед измерения 'C' или 'F'). срез позволяет получить только числовую часть температуры.
    


    # Преобразуем в Фаренгейты
    fahrenheit = (celsius * 9/5) + 32  # Формула преобразования
#fahrenheit = - мы создаём переменную fahrenheit и присваиваем ей значение.
#(celsius * 9/5) + 32 - это формула для преобразования температуры из Цельсия в Фаренгейт. Мы сначала умножаем celsius на 9/5, а затем добавляем 32.    
      
    # Выводим 
    print(f"{celsius}C = {fahrenheit:.2f}F")  # Выводим в формате с 2 знаками после запятой
#f"{celsius}C = {fahrenheit:.2f}F" - это f-строка. Мы вставляем значения переменных celsius и fahrenheit в текст, добавляя 'C' и 'F' после них.
#{fahrenheit:.2f} - это значит, что мы выводим fahrenheit с двумя знаками после запятой.

    # Проверка на Ф
elif temp[-1] == 'F':
    
    # Получаем числовую часть температуры
    fahrenheit = float(temp[:-1])  # Преобразуем строку в число// аналогично тому, что мы делали для celsius
#elif - уже другое условие, которое проверяется, если первое условие (с 'C') не выполнено.
#temp[-1] == 'F' - проверяем, равен ли последний символ 'F'. Если это так, то выполняется код под ним.
    
    
    
    # Преобразуем в Цельсии
    celsius = (fahrenheit - 32) * 5/9  # Формула преобразования
    # Выводим результат
    print(f"{fahrenheit}F = {celsius:.2f}C")  #                                     ???разобрать опять
#f"..." –  f-строка (форматированная строка).чтобы вставлять значения переменных внутрь строки. Буква f перед кавычками указывает, что это форматированная строка, и в ней можно использовать фигурные скобки {} для вставки значений переменных.
#{} – для вставки значения переменной внутрь строки.
#fahrenheit – это переменная, содержащая значение температуры в Фаренгейтах, которую мы хотим показать в выводе 
#:.2f – это форматирование числа
#: – указывает, что мы будем применять форматирование к значению переменной.
#.2f – значит, что мы хотим вывести значение "celsius" как число с плавающей запятой с 2 знаками после запятой. Типо, если celsius равно 0.123456, то с форматированием :.2f оно будет выведено как 0.12.

else:  # Если ввод некорректен
 print("Некорректный ввод.")

>>>>>>> 0234b2e51a35f951b82610cb0b9bce80251d261f
temp = input("Введите температуру (например, 40C или 100F): ")  # Вводим строку
#temp - название переменной, в которую будет сохранён ввод пользователя.
#= - оператор присвРаивания //для присвоения значения, которое находится справа, переменной слева. Тут присваиваем результат функции input() переменной temp.
#input(...) - запрашивает у пользователя ввод данных с клавиатуры. 



# Удалить пробелы в начале и конце строки
temp = temp.strip()  # тут метод строк 

#temp.strip() - удаляет лишние пробелы в начале и конце строки, если они есть
#temp = - мы снова присваиваем результат (строку без пробелов) обратно переменной temp


# Проверка, заканчивается ли строка на 'C' или 'F'
if temp[-1] == 'C':  # Проверка последнего символа
#if - условный оператор. Ппроверяет, выполняется ли условие. Если да, то выполняется код под ним.
#temp[-1] - способ получить последний символ строки temp. !! "-1" означает, что мы берём последний символ.
#== 'C' - мы сравниваем последний символ с буквой 'C'. Если они равны, то условие выполняется.



    # Получаем числовую часть температурык
    celsius = float(temp[:-1])  # Преобразуем строку в число
#float(...) - преобразует строку в число с плавающей запятой (например, 40.0).
#temp[:-1] -  берём всю строку temp, кроме последнего символа (ед измерения 'C' или 'F'). срез позволяет получить только числовую часть температуры.
    


    # Преобразуем в Фаренгейты
    fahrenheit = (celsius * 9/5) + 32  # Формула преобразования
#fahrenheit = - мы создаём переменную fahrenheit и присваиваем ей значение.
#(celsius * 9/5) + 32 - это формула для преобразования температуры из Цельсия в Фаренгейт. Мы сначала умножаем celsius на 9/5, а затем добавляем 32.    
      
    # Выводим 
    print(f"{celsius}C = {fahrenheit:.2f}F")  # Выводим в формате с 2 знаками после запятой
#f"{celsius}C = {fahrenheit:.2f}F" - это f-строка. Мы вставляем значения переменных celsius и fahrenheit в текст, добавляя 'C' и 'F' после них.
#{fahrenheit:.2f} - это значит, что мы выводим fahrenheit с двумя знаками после запятой.

    # Проверка на Ф
elif temp[-1] == 'F':
    
    # Получаем числовую часть температуры
    fahrenheit = float(temp[:-1])  # Преобразуем строку в число// аналогично тому, что мы делали для celsius
#elif - уже другое условие, которое проверяется, если первое условие (с 'C') не выполнено.
#temp[-1] == 'F' - проверяем, равен ли последний символ 'F'. Если это так, то выполняется код под ним.
    
    
    
    # Преобразуем в Цельсии
    celsius = (fahrenheit - 32) * 5/9  # Формула преобразования
    # Выводим результат
    print(f"{fahrenheit}F = {celsius:.2f}C")  #                                     ???разобрать опять
#f"..." –  f-строка (форматированная строка).чтобы вставлять значения переменных внутрь строки. Буква f перед кавычками указывает, что это форматированная строка, и в ней можно использовать фигурные скобки {} для вставки значений переменных.
#{} – для вставки значения переменной внутрь строки.
#fahrenheit – это переменная, содержащая значение температуры в Фаренгейтах, которую мы хотим показать в выводе 
#:.2f – это форматирование числа
#: – указывает, что мы будем применять форматирование к значению переменной.
#.2f – значит, что мы хотим вывести значение "celsius" как число с плавающей запятой с 2 знаками после запятой. Типо, если celsius равно 0.123456, то с форматированием :.2f оно будет выведено как 0.12.

else:  # Если ввод некорректен
    print("Некорректный ввод. Пожалуйста, используйте формат 12C или 100F.")  # Сообщение об ошибке